УТ.РасширениеКонтурЛогистика/src/Enums/КонтурЛогистика_СтатусыКонтрагентов/КонтурЛогистика_СтатусыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_СтатусыКонтрагентов</name>
  <comment>https://api-docs.diadoc.ru/ru/latest/proto/Counteragent.html?highlight=CurrentStatus</comment>
  <enumValues>
    <name>UnknownCounteragentStatus</name>
  </enumValues>
  <enumValues>
    <name>IsMyCounteragent</name>
  </enumValues>
  <enumValues>
    <name>InvitesMe</name>
  </enumValues>
  <enumValues>
    <name>IsInvitedByMe</name>
  </enumValues>
  <enumValues>
    <name>RejectsMe</name>
  </enumValues>
  <enumValues>
    <name>IsRejectedByMe</name>
  </enumValues>
  <enumValues>
    <name>NotInCounteragentList</name>
  </enumValues>
</mdclass:Enum>

УТ.РасширениеКонтурЛогистика/src/CommonForms/КонтурЛогистика_ФормаДружбыКонтрагентов/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.ГруппаАвтодружба.Видимость = Ложь;
	
	Если Параметры.Свойство("Отправитель") И Параметры.Свойство("Получатель") Тогда
		
		Если Параметры.Отправитель.Наш И Не Параметры.Получатель.Наш Тогда
			Организация = Параметры.Отправитель;
			Контрагент = Параметры.Получатель;	
		ИначеЕсли Не Параметры.Отправитель.Наш И Параметры.Получатель.Наш Тогда
			Организация = Параметры.Получатель;
			Контрагент = Параметры.Отправитель;	
		Иначе
			Организация = Параметры.Отправитель;
			Контрагент = Параметры.Получатель;
		КонецЕсли;
		
		Параметры.Свойство("Валидатор", Валидатор);
		Параметры.Свойство("ПроверитьАпиКлючОтправителя", ПроверитьАпиКлючОтправителя);  
		Параметры.Свойство("ПроверитьАвтодружбу", ПроверитьАвтодружбу);
		
		Если Валидатор И ПроверитьАвтодружбу Тогда
			
			Элементы.Организация.ТолькоПросмотр = Истина;
			Элементы.Контрагент.ТолькоПросмотр = Истина;
			
			Если ПроверитьАпиКлючОтправителя Тогда
				ПараметрыСервиса = КонтурЛогистика_ИнтеграцияAPI_ЛогистикаПовтИсп.ПараметрыСервисаЛогистика(Организация);
				Если ПараметрыСервиса.АвторизацияВыполнена Тогда
					ПроверитьПриглашение();
					Возврат;
				КонецЕсли;
			КонецЕсли;
			
			ВывестиАвтодружбу();
			
		КонецЕсли;
		
		ПроверитьПриглашение();
		
	ИначеЕсли Параметры.Свойство("Отправитель") И Не Параметры.Свойство("Получатель") Тогда
		
		Организация = Параметры.Отправитель;
		
	ИначеЕсли Не Параметры.Свойство("Отправитель") И Параметры.Свойство("Получатель") Тогда
		
		Контрагент = Параметры.Получатель;
		
	КонецЕсли;
			
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УправлениеЭлементамиФормы();
	
	Если КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЭтоИнтерфейс82() Тогда
		Элементы.ТекстСтатус.Высота = 2;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура УправлениеЭлементамиФормы()
	
	Элементы.ТекстСтатус.Заголовок = ТекущийСтатус;
	
	Элементы.ГруппаАвтодружба.Видимость = ЗначениеЗаполнено(Элементы.ТекстАвтодружба.Заголовок) 
		И ТекущийСтатус <> ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтатусыКонтрагентов.IsMyCounteragent");
				
	ОпределитьДействие();
	
КонецПроцедуры

&НаСервере
Процедура ОпределитьДействие()
	
	Если Организация.Автодружба И Контрагент.Автодружба 
		И (ТекущийСтатус <> Перечисления.КонтурЛогистика_СтатусыКонтрагентов.RejectsMe
			Или ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыКонтрагентов.IsRejectedByMe) Тогда
		Элементы.ВыполнитьДействие.Заголовок = "Закрыть";
		Элементы.ТекстАвтодружба.Заголовок = "Автоприглашение установлено";
	ИначеЕсли ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыКонтрагентов.IsMyCounteragent Тогда
		Элементы.ВыполнитьДействие.Заголовок = "Закрыть";	
	ИначеЕсли ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыКонтрагентов.InvitesMe И Не ТребуетсяПодпись Тогда
		Элементы.ВыполнитьДействие.Заголовок = "Принять";
	ИначеЕсли ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыКонтрагентов.InvitesMe И ТребуетсяПодпись Тогда
		Элементы.ВыполнитьДействие.Заголовок = "Проверить приглашение";
	ИначеЕсли ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыКонтрагентов.IsInvitedByMe Тогда
		Элементы.ВыполнитьДействие.Заголовок = "Проверить приглашение";
	ИначеЕсли ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыКонтрагентов.NotInCounteragentList 
		ИЛИ ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыКонтрагентов.RejectsMe
		ИЛИ ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыКонтрагентов.IsRejectedByMe
	Тогда
		Элементы.ВыполнитьДействие.Заголовок = "Пригласить";
	Иначе
		Элементы.ВыполнитьДействие.Заголовок = "Закрыть";	
	КонецЕсли;
	
	Элементы.ГруппаСообщение.Видимость = Ложь;
	Если ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыКонтрагентов.InvitesMe И ТребуетсяПодпись Тогда
		Элементы.ТекстСообщение.Заголовок = "Приглашение требует подписи.";
		Элементы.ТекстСсылкаДД.Заголовок = "Перейдите в Диадок для принятия приглашения.";
		Элементы.ГруппаСообщение.Видимость = Истина;
	КонецЕсли;
	
	Если Элементы.ВыполнитьДействие.Заголовок = "Пригласить" Тогда
		Элементы.ВыполнитьДействие.ОтображениеПодсказки = ОтображениеПодсказки.Кнопка;
		Этаформа.Команды.ВыполнитьДействие.Подсказка = "Если контрагент - ""наша"" организация, то принятие приглашения выполниться автоматически.";
	Иначе
		Элементы.ВыполнитьДействие.ОтображениеПодсказки = ОтображениеПодсказки.Нет;
		Этаформа.Команды.ВыполнитьДействие.Подсказка = "";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьДействие(Команда)
	
	Действие = Элементы.ВыполнитьДействие.Заголовок;
	
	Если Действие = "Закрыть" Тогда		
		Закрыть();
		Возврат;
	КонецЕсли;
	
	Если Организация.Пустая() Тогда
		Сообщить("Не заполнена организация");
		Возврат;
	КонецЕсли;
	
	Если Контрагент.Пустая() Тогда
		Сообщить("Не заполнен контрагент");
		Возврат;
	КонецЕсли;	
	
	Если Действие = "Пригласить" Тогда		
		ПригласитьКонтрагента();		
	ИначеЕсли Действие = "Проверить приглашение" Тогда 		
		ПроверитьПриглашение();		
	ИначеЕсли Действие = "Принять" Тогда		
		ПригласитьКонтрагента();		
	КонецЕсли;
	
	УправлениеЭлементамиФормы();
	
	Оповестить("ОбновитьКонтрагентовОрганизации");
	
КонецПроцедуры

&НаСервере
Процедура ПригласитьКонтрагента()
	
	TaskId = КонтурЛогистика_API_Диадок.Диадок_АПИ_AcquireCounteragent(Организация, Контрагент);
	
	Если Организация.Наш И Контрагент.Наш Тогда
		
		TaskId = КонтурЛогистика_API_Диадок.Диадок_АПИ_AcquireCounteragent(Контрагент, Организация);
		
		ВремяОжидания = 0;                       
		Счетчик = 0;
		ПроверитьAcquireCounteragent(TaskId, ВремяОжидания, Счетчик);
		
	Иначе
		
		ВремяОжидания = 0;                       
		Счетчик = 0;
		ПроверитьAcquireCounteragent(TaskId, ВремяОжидания, Счетчик);
		
	КонецЕсли;
			
КонецПроцедуры

&НаСервере
Процедура ПроверитьAcquireCounteragent(TaskId, ВремяОжидания, Счетчик)
	
	Если Счетчик < 5 Тогда // Счетчик, вместо бесконечного цикла Пока Истина Цикл
		
		Если ВремяОжидания > 0 Тогда
			КонтурЛогистика_ОбщегоНазначенияСервер.Пауза(ВремяОжидания);
		КонецЕсли;
		
		РезультатОтправки = КонтурЛогистика_API_Диадок.Диадок_АПИ_AcquireCounteragentResult(Организация, TaskId);
		
		Если РезультатОтправки.Свойство("ВремяОжидания") Тогда
			
			Если РезультатОтправки.ВремяОжидания > 0 Тогда
				
				Счетчик = Счетчик + 1;
				ПроверитьAcquireCounteragent(TaskId, РезультатОтправки.ВремяОжидания, Счетчик);
				
			Иначе
				
				ПроверитьПриглашение();
								
			КонецЕсли;
			
		Иначе
			
			ПроверитьПриглашение();
					
		КонецЕсли;
		
	Иначе
		
		ПроверитьПриглашение();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьПриглашение()
	
	Если Организация.Пустая() Или Контрагент.Пустая() Тогда
		ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыКонтрагентов.ПустаяСсылка();
		Возврат;
	КонецЕсли;
	
	Counteragent = КонтурЛогистика_API_Диадок.Диадок_АПИ_GetCounteragent(Организация, Контрагент);	
	ТекущийСтатус = КонтурЛогистика_ОбщегоНазначенияСервер.СтатусОтношенияСКонтрагентом(Counteragent);
	
	Если ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыКонтрагентов.InvitesMe 
		И КонтурЛогистика_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Counteragent, "InvitationDocumentId") <> Неопределено 
	Тогда
		
		MessageId	 = Counteragent.InvitationDocumentId.MessageId;
		EntityId	 = Counteragent.InvitationDocumentId.EntityId;
		
		//получаем данные файла приглашения
		Данные = КонтурЛогистика_API_Диадок.Диадок_АПИ_GetEntityContent(Контрагент, MessageId, EntityId);
		
		Message	 = КонтурЛогистика_API_Диадок.Диадок_АПИ_GetMessage(Контрагент, MessageId, EntityId);
		Entity	 = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.МассивСтруктур_Найти(Message.Entities, EntityId, "EntityId");
				
		ТребуетсяПодпись = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Entity, "NeedRecipientSignature", Ложь);
		
	КонецЕсли;
	
	Если ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыКонтрагентов.IsMyCounteragent Тогда
		ЗаписатьСтатусы(Перечисления.КонтурЛогистика_СтатусыКонтрагентов.IsMyCounteragent, Перечисления.КонтурЛогистика_СтатусыКонтрагентов.IsMyCounteragent);	
	КонецЕсли;
	Если ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыКонтрагентов.IsInvitedByMe Тогда
		ЗаписатьСтатусы(Перечисления.КонтурЛогистика_СтатусыКонтрагентов.IsInvitedByMe, Перечисления.КонтурЛогистика_СтатусыКонтрагентов.InvitesMe);	
	КонецЕсли;
	Если ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыКонтрагентов.InvitesMe Тогда
		ЗаписатьСтатусы(Перечисления.КонтурЛогистика_СтатусыКонтрагентов.InvitesMe, Перечисления.КонтурЛогистика_СтатусыКонтрагентов.IsInvitedByMe);	
	КонецЕсли;
	Если ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыКонтрагентов.IsRejectedByMe Тогда
		ЗаписатьСтатусы(Перечисления.КонтурЛогистика_СтатусыКонтрагентов.IsRejectedByMe, Перечисления.КонтурЛогистика_СтатусыКонтрагентов.RejectsMe);	
	КонецЕсли;
	Если ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыКонтрагентов.RejectsMe Тогда
		ЗаписатьСтатусы(Перечисления.КонтурЛогистика_СтатусыКонтрагентов.RejectsMe, Перечисления.КонтурЛогистика_СтатусыКонтрагентов.IsRejectedByMe);	
	КонецЕсли;
	
	// ПроверимАвтоприглашение
	Если Не ПроверитьАвтодружбу Тогда
		Возврат;
	КонецЕсли;
	
	Если Организация.Наш Тогда
		
		ПараметрыСервиса = КонтурЛогистика_ИнтеграцияAPI_ЛогистикаПовтИсп.ПараметрыСервисаЛогистика(Организация);
		Если ПараметрыСервиса.АвторизацияВыполнена Тогда
			Справочники.КонтурЛогистика_ОрганизацииДиадок.СинхронизироватьНастройкиОрганизации(Организация);
		КонецЕсли;
		
	КонецЕсли;
	
	Если Контрагент.Наш Тогда
		
		ПараметрыСервиса = КонтурЛогистика_ИнтеграцияAPI_ЛогистикаПовтИсп.ПараметрыСервисаЛогистика(Контрагент);
		Если ПараметрыСервиса.АвторизацияВыполнена Тогда
			Справочники.КонтурЛогистика_ОрганизацииДиадок.СинхронизироватьНастройкиОрганизации(Контрагент);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьСтатусы(СтатусОрганизации, СтатусКонтрагента)
	
	КонтурЛогистика_ОбщегоНазначенияСервер.ЗаписатьСтатусы(Организация, Контрагент, СтатусОрганизации, СтатусКонтрагента);
			
КонецПроцедуры

&НаКлиенте
Процедура ТекстСсылкаДДНажатие(Элемент)
	
	boxId = КонтурЛогистика_ОбщегоНазначенияКлиент.ЗначениеРеквизитаОбъекта_КонтурЛогистика(Организация, "ID");
	
	Если КонтурЛогистика_ОбщегоНазначенияКлиентПовтИсп.ЗначениеНастройки("ИспользоватьТестовыйСерверДиадок") Тогда
		СсылкаДиадок = "https://diadoc-staging.kontur.ru/" + boxId + "/Counteragents/Inviting";		
	Иначе
		СсылкаДиадок = "https://diadoc.kontur.ru/" + boxId + "/Counteragents/Inviting";
	КонецЕсли;
	
	Если КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЭтоИнтерфейс82() Тогда
		ЗапуститьПриложение(СсылкаДиадок);
	Иначе
		ПерейтиПоНавигационнойСсылке(СсылкаДиадок);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	НашаОрганизация = КонтурЛогистика_ОбщегоНазначенияКлиент.ЗначениеРеквизитаОбъекта_КонтурЛогистика(Организация, "Наш");
	Если Не НашаОрганизация Тогда
		Сообщить("Выберите нашу организацию");
		Организация = "";
		Возврат;
	КонецЕсли;
	
	Если Организация = Контрагент Тогда
		Сообщить("Выберите организацию отличную от контрагента");
		Организация = "";
		Возврат;
	КонецЕсли;
	
	ПроверитьПриглашение();
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	Если Организация = Контрагент Тогда
		Сообщить("Выберите контрагента отличного от организации");
		Контрагент = "";
		Возврат;
	КонецЕсли;
	
	ПроверитьПриглашение();
	УправлениеЭлементамиФормы();
		
КонецПроцедуры

&НаСервере
Процедура ВывестиАвтодружбу()
			
	Если ЗначениеЗаполнено(Организация)
		И ЗначениеЗаполнено(Контрагент)
		И (Не Организация.Автодружба Или Не Контрагент.Автодружба)
		И ТекущийСтатус <> Перечисления.КонтурЛогистика_СтатусыКонтрагентов.RejectsMe 
		И ТекущийСтатус <> Перечисления.КонтурЛогистика_СтатусыКонтрагентов.IsRejectedByMe 
		И ТекущийСтатус <> Перечисления.КонтурЛогистика_СтатусыКонтрагентов.IsMyCounteragent Тогда
		
		ТекстАвтодружбы = "Автоприглашение не установлено. У организации ";
		
		Если Не Организация.Автодружба Тогда
			
			Элементы.ГруппаАвтодружба.Видимость = Истина;
			ТекстАвтодружбы = ТекстАвтодружбы + Организация.Наименование;
			
		КонецЕсли;
		
		Если Не Контрагент.Автодружба Тогда
			
			Элементы.ГруппаАвтодружба.Видимость = Истина;
			ТекстАвтодружбы = ТекстАвтодружбы + " и " + Контрагент.Наименование;
						
		КонецЕсли;
		
		ТекстАвтодружбы = ТекстАвтодружбы + " не установлен признак автоприглашения. Автоприглашение можно установить в настройках сервиса Логистика. "
										+ "Установка признака доступна пользователю с правами администратора.";
		
		Элементы.ТекстАвтодружба.Заголовок = ТекстАвтодружбы;
				
	Иначе
		
		Элементы.ГруппаАвтодружба.Видимость = Ложь;	
		
	КонецЕсли;
	
КонецПроцедуры
